---
kind: property
id: P:Autodesk.Revit.DB.ExternalDefinitionCreationOptions.HideWhenNoValue
source: html/2a3a90d6-cf4b-ae88-b587-612dc96c0bc2.htm
---
# Autodesk.Revit.DB.ExternalDefinitionCreationOptions.HideWhenNoValue Property

This property indicates whether this parameter should be hidden from the properties palette
 when it doesn't have a value.

## Syntax (C#)
```csharp
public bool HideWhenNoValue { get; set; }
```